season = {'水瓶座': '1/20 ~ 2/18 需警惕小人',
          '双鱼座': '2/19 ~ 3/20 凌乱中找立足',
          '白羊座': '3/21 ~ 4/19 运势比较低迷',
          '金牛座': '4/20 ~ 5/20 财运较佳',
          '双子座': '5/21 ~ 6/21 运势好可锦上添花',
          '巨蟹座': '6/22 ~ 7/22 不可松懈大意',
          '狮子座': '7/23 ~ 8/22 会有成就感',
          '处女座': '8/23 ~ 9/22 会有挫折感',
          '天枰座': '9/23 ~ 10/23 运势给力',
          '天蝎座': '10/24 ~ 11/22 中规中矩',
          '射手座': '11/23 ~ 12/21 可羡煞众人',
          '魔蝎座': '12/22 ~ 1/19 需保有谦虚',
          }

# 提示用户输入对应的星座
word = input('请输入您的星座:')

# 判断
if word in season:
    print(season[word])
else:
    print('没有该星座')
